In [51]:
import pandas as pd

In [52]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [53]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [54]:
df = employee.groupby('managerId').size().reset_index(name="managers")

In [55]:
df = df.merge(right=employee[["id", "name"]], how="inner", right_on='id', left_on='managerId')

In [57]:
df[df["managers"] >= 5]

   managerId  managers   id  name
0        101         5  101  John